# running in BONUS_gcd_cover/src/
read -formal BONUS_gcd.sv
read -formal gcd_ctrl.sv
prep -top gcd

memory_nordff
async2sync
chformal -assume -early
chformal -live -fair -cover -remove
opt_clean
setundef -anyseq
opt -keepdc -fast
check
hierarchy -simcheck
write_ilang ../model/design.il
